# -*- coding: utf-8 -*-
# @Time    : 2019/6/26 13:44
# @Author  : lance
# @File    : test.py
# @Software: PyCharm


def foo():
    print("starting...")
    while True:
        res = yield 4
        print("res:", res)


def unique_index(L, e):
    return [j for (i, j) in enumerate(L) if i == e]


def test():
    list = [
        {
            '刘勇': 2,
            'device_key': '84E0F422313307B2'
        },
        {
            '刘勇': 2,
            'device_key': '84E0F421A98607B2'
        },
        {
            '刘勇': 2,
            'device_key': '84E0F422312B07B2'
        },
        {
            '刘勇': 2,
            'device_key': '84E0F422295B07B2'
        },
        {
            '刘勇': 2,
            'device_key': '84E0F421D92C07B2'
        },
        {
            '刘勇': 2,
            'device_key': '84E0F422289D07B2'
        },
        {
            '张志锋': 2,
            'device_key': '84E0F42265EF07B2'
        },
        {
            '张志锋': 2,
            'device_key': '84E0F42265B707B2'
        },
        {
            '王坤': 2,
            'device_key': '84E0F422CB7107B2'
        },
        {
            '王坤': 2,
            'device_key': '84E0F422CB1D07B2'
        },
        {
            '王坤': 2,
            'device_key': '84E0F422CB7407B2'
        },
        {
            '王坤': 2,
            'device_key': '84E0F422CB3207B2'
        },
        {
            '王坤': 2,
            'device_key': '84E0F422CB6907B2'
        },
        {
            '王坤': 2,
            'device_key': '84E0F422CB5B07B2'
        },
        {
            '王磊': 2,
            '徐志红': 2,
            '孙林': 2,
            '李刚': 2,
            '唐永环': 2,
            '王伟': 2,
            '王勇': 3,
            '徐林': 2,
            '李洋': 2,
            'device_key': '84E0F422CB7607B2'
        },
        {
            '王磊': 2,
            '徐志红': 2,
            '孙林': 2,
            '李刚': 2,
            '唐永环': 2,
            '王伟': 2,
            '王勇': 3,
            '徐林': 2,
            '李洋': 2,
            'device_key': '84E0F422CB5C07B2'
        },
        {
            '王磊': 2,
            '徐志红': 2,
            '孙林': 2,
            '李刚': 2,
            '唐永环': 2,
            '王伟': 2,
            '王勇': 3,
            '徐林': 2,
            '李洋': 2,
            'device_key': '84E0F422CB6107B2'
        },
        {
            '王磊': 2,
            '徐志红': 2,
            '孙林': 2,
            '李刚': 2,
            '唐永环': 2,
            '王伟': 2,
            '王勇': 3,
            '徐林': 2,
            '李洋': 2,
            'device_key': '84E0F422CB4307B2'
        },
        {
            '王磊': 2,
            '徐志红': 2,
            '孙林': 2,
            '李刚': 2,
            '唐永环': 2,
            '王伟': 2,
            '王勇': 3,
            '徐林': 2,
            '李洋': 2,
            'device_key': '84E0F422CB5307B2'
        },
        {
            '王磊': 2,
            '徐志红': 2,
            '孙林': 2,
            '李刚': 2,
            '唐永环': 2,
            '王伟': 2,
            '王勇': 3,
            '徐林': 2,
            '李洋': 2,
            'device_key': '84E0F422CB6007B2'
        },
        {
            '陈金山': 2,
            '朱磊': 2,
            '罗会均': 2,
            'device_key': '84E0F422289707B2'
        },
        {
            '陈金山': 2,
            '朱磊': 2,
            '罗会均': 2,
            'device_key': '84E0F42229E907B2'
        },
        {
            '陈金山': 2,
            '朱磊': 2,
            '罗会均': 2,
            'device_key': '84E0F422282207B2'
        },
        {
            '陈金山': 2,
            '朱磊': 2,
            '罗会均': 2,
            'device_key': '84E0F422289107B2'
        },
        {
            '钟建军': 2,
            'device_key': '84E0F421AB6307B2'
        },
        {
            '钟建军': 2,
            'device_key': '84E0F421AB5E07B2'
        },
        {
            '方杭杰': 2,
            'device_key': '84E0F42147FF07B2'
        },
        {
            '邵岳鹏': 2,
            'device_key': '84E0F421300407B2'
        },
        {
            '尹忠兵': 2,
            'device_key': '84E0F42153F807B2'
        },
        {
            '尹忠兵': 2,
            'device_key': '84E0F42153EF07B2'
        },
        {
            '尹忠兵': 2,
            'device_key': '84E0F42153F307B2'
        },
        {
            '尹忠兵': 2,
            'device_key': '84E0F42153CD07B2'
        },
        {
            '李婷': 2,
            'device_key': '84E0F42147C507B2'
        },
        {
            '李婷': 2,
            'device_key': '84E0F42147A507B2'
        },
        {
            '李婷': 2,
            'device_key': '84E0F42147F807B2'
        },
        {
            '李婷': 2,
            'device_key': '84E0F42147F207B2'
        },
        {
            '李明虎': 2,
            'device_key': '84E0F422BA6907B2'
        },
        {
            '张杰': 2,
            'device_key': '84E0F4212ACF07B2'
        },
        {
            '陈伟': 2,
            '林会昌': 2,
            '李敏': 2,
            '阚绪芹': 2,
            'device_key': '84E0F4212A6307B2'
        },
        {
            '郁从永': 2,
            '陈泽虎': 2,
            '李伟': 2,
            '张杰': 2,
            'device_key': '84E0F422651507B2'
        },
        {
            '郁从永': 2,
            '陈泽虎': 2,
            '李伟': 2,
            '张杰': 2,
            'device_key': '84E0F42272E107B2'
        },
        {
            '郁从永': 2,
            '陈泽虎': 2,
            '李伟': 2,
            '张杰': 2,
            'device_key': '84E0F422730E07B2'
        },
        {
            '李辉': 2,
            'device_key': '84E0F421679A07B2'
        },
        {
            '李辉': 2,
            'device_key': '84E0F421334E07B2'
        },
        {
            '张杰': 2,
            'device_key': '84E0F4212A9707B2'
        },
        {
            '李斌': 2,
            '王金平': 2,
            '戴荣明': 2,
            'device_key': '84E0F421302507B2'
        },
        {
            '李斌': 2,
            '王金平': 2,
            '戴荣明': 2,
            'device_key': '84E0F4212FE807B2'
        },
        {
            '陈伟': 2,
            '李胜志': 2,
            '林会昌': 2,
            '李敏': 2,
            '阚绪芹': 2,
            '周之生': 2,
            'device_key': '84E0F4212ADD07B2'
        },
        {
            '陈伟': 2,
            '李胜志': 2,
            '林会昌': 2,
            '李敏': 2,
            '阚绪芹': 2,
            '周之生': 2,
            'device_key': '84E0F4212FD207B2'
        },
        {
            '陈伟': 2,
            '李胜志': 2,
            '林会昌': 2,
            '李敏': 2,
            '阚绪芹': 2,
            '周之生': 2,
            'device_key': '84E0F4212B4507B2'
        },
        {
            '王永': 3,
            'device_key': '84E0F421672B07B2'
        },
        {
            '王永': 3,
            'device_key': '84E0F421673A07B2'
        },
        {
            '薛加海': 2,
            '李伟': 2,
            '范迪表': 2,
            '王永': 2,
            'device_key': '84E0F42153E807B2'
        },
        {
            '薛加海': 2,
            '李伟': 2,
            '范迪表': 2,
            '王永': 2,
            'device_key': '84E0F42153EB07B2'
        },
        {
            '李胜志': 2,
            'device_key': '84E0F42147CE07B2'
        },
        {
            '李胜志': 2,
            'device_key': '84E0F42147BE07B2'
        },
        {
            '吴启连': 2,
            'device_key': '84E0F422C08707B2'
        },
        {
            '吴启连': 2,
            'device_key': '84E0F422BCB507B2'
        },
        {
            '罗德翠': 2,
            'device_key': '84E0F421674D07B2'
        },
        {
            '罗德翠': 2,
            'device_key': '84E0F421677D07B2'
        },
        {
            '李勇': 2,
            '范迪表': 2,
            'device_key': '84E0F42272F007B2'
        },
        {
            '郁从永': 2,
            '陈泽虎': 2,
            '李伟': 2,
            '张杰': 2,
            'device_key': '84E0F422736907B2'
        },
        {
            '张杰': 2,
            '陈泽虎': 2,
            '郁从永': 2,
            '李伟': 2,
            'device_key': '84E0F422729A07B2'
        },
        {
            '张杰': 2,
            '陈泽虎': 2,
            '郁从永': 2,
            '李伟': 2,
            'device_key': '84E0F422643007B2'
        },
        {
            '张杰': 2,
            '陈泽虎': 2,
            '郁从永': 2,
            '李伟': 2,
            'device_key': '84E0F422736707B2'
        },
        {
            '张杰': 2,
            '陈泽虎': 2,
            '郁从永': 2,
            '李伟': 2,
            'device_key': '84E0F422659F07B2'
        },
        {
            '李勇': 2,
            '范迪表': 2,
            'device_key': '84E0F422732A07B2'
        },
        {
            '李勇': 2,
            '范迪表': 2,
            'device_key': '84E0F42272D007B2'
        },
        {
            '李勇': 2,
            '范迪表': 2,
            'device_key': '84E0F42264C807B2'
        },
        {
            '王永': 2,
            '陈万龙': 2,
            '林会昌': 2,
            '卢炳辉': 2,
            '王进翠': 2,
            '李杰': 2,
            '赵明义': 2,
            'device_key': '84E0F421479A07B2'
        },
        {
            '王永': 2,
            '陈万龙': 2,
            '林会昌': 2,
            '卢炳辉': 2,
            '王进翠': 2,
            '李杰': 2,
            '赵明义': 2,
            'device_key': '84E0F421480007B2'
        },
        {
            '郭世江': 2,
            'device_key': '84E0F421334507B2'
        },
        {
            '郭世江': 2,
            'device_key': '84E0F42147DA07B2'
        },
        {
            '徐家军': 2,
            '许建': 2,
            '朱泽龙': 2,
            '杨茂兵': 2,
            '申恩海': 2,
            '刘永刚': 2,
            '王杰': 2,
            '王超': 2,
            '王龙': 2,
            'device_key': '84E0F4212A7807B2'
        },
        {
            '徐家军': 2,
            '许建': 2,
            '朱泽龙': 2,
            '杨茂兵': 2,
            '申恩海': 2,
            '刘永刚': 2,
            '王杰': 2,
            '王超': 2,
            '王龙': 2,
            'device_key': '84E0F4212A7607B2'
        },
        {
            '徐家军': 2,
            '朱泽龙': 2,
            '许建': 2,
            '杨茂兵': 2,
            '申恩海': 2,
            '刘永刚': 2,
            '王杰': 2,
            '王超': 2,
            '王龙': 2,
            'device_key': '84E0F421300507B2'
        },
        {
            '李明虎': 2,
            'device_key': '84E0F422BA4807B2'
        },
        {
            '孟凡军': 2,
            'device_key': '84E0F421AC3E07B2'
        },
        {
            '孟凡军': 2,
            'device_key': '84E0F421AC3D07B2'
        },
        {
            '孟凡军': 2,
            'device_key': '84E0F422F7F607B2'
        },
        {
            '孟凡军': 2,
            'device_key': '84E0F422BC7C07B2'
        },
        {
            '张言会': 2,
            'device_key': '84E0F421AB6607B2'
        },
        {
            '张言会': 2,
            'device_key': '84E0F421D84107B2'
        },
        {
            '张言会': 2,
            'device_key': '84E0F421AC3C07B2'
        },
        {
            '张言会': 2,
            'device_key': '84E0F421D9AA07B2'
        },
        {
            '李志': 2,
            'device_key': '84E0F421542007B2'
        },
        {
            '李志': 2,
            'device_key': '84E0F42153ED07B2'
        },
        {
            '刘兵': 2,
            'device_key': '84E0F42265BB07B2'
        },
        {
            '刘兵': 2,
            'device_key': '84E0F422661507B2'
        },
        {
            '陈若军': 2,
            '张强': 2,
            'device_key': '84E0F421AB6507B2'
        },
        {
            '陈若军': 2,
            '张强': 2,
            'device_key': '84E0F421AC3F07B2'
        },
        {
            '陈若军': 2,
            '张强': 2,
            'device_key': '84E0F421ADFA07B2'
        },
        {
            '陈若军': 2,
            '张强': 2,
            'device_key': '84E0F421AADE07B2'
        },
        {
            '张萍': 2,
            '陈振': 2,
            'device_key': '84E0F422BC3B07B2'
        },
        {
            '张萍': 2,
            '陈振': 2,
            'device_key': '84E0F422BD3A07B2'
        },
        {
            '张萍': 2,
            '陈振': 2,
            'device_key': '84E0F422BB3607B2'
        },
        {
            '张萍': 2,
            '陈振': 2,
            'device_key': '84E0F422C01907B2'
        },
        {
            '王凯': 2,
            '任士兵': 2,
            '张翠侠': 2,
            '张浩': 2,
            'device_key': '84E0F421DE1607B2'
        },
        {
            '王凯': 2,
            '任士兵': 2,
            '张翠侠': 2,
            '张浩': 2,
            'device_key': '84E0F421D76A07B2'
        },
        {
            '王凯': 2,
            '任士兵': 2,
            '张翠侠': 2,
            '张浩': 2,
            'device_key': '84E0F421D8B607B2'
        },
        {
            '王凯': 2,
            '任士兵': 2,
            '张翠侠': 2,
            '张浩': 2,
            'device_key': '84E0F421D7BA07B2'
        },
        {
            '杨磊': 2,
            '王永': 2,
            '张凯': 2,
            '张华': 2,
            '陈杰': 2,
            '王勇': 2,
            'device_key': '84E0F421AFB107B2'
        },
        {
            '杨磊': 2,
            '王永': 2,
            '张凯': 2,
            '张华': 2,
            '陈杰': 2,
            '王勇': 2,
            'device_key': '84E0F421AFB407B2'
        },
        {
            '王永': 2,
            '陈杰': 2,
            '王勇': 2,
            '杨磊': 2,
            '张凯': 2,
            '张华': 2,
            'device_key': '84E0F421AA2807B2'
        },
        {
            '杨磊': 2,
            '王永': 2,
            '张凯': 2,
            '张华': 2,
            '陈杰': 2,
            '王勇': 2,
            'device_key': '84E0F421AE9107B2'
        },
        {
            '陈若军': 2,
            '张强': 2,
            'device_key': '84E0F422BAF707B2'
        },
        {
            '陈若军': 2,
            '张强': 2,
            'device_key': '84E0F421A8B907B2'
        },
        {
            '李秀英': 2,
            '张彬': 2,
            '盛先明': 2,
            '黄昌胜': 2,
            '刘怀敏': 2,
            'device_key': '84E0F42147FD07B2'
        },
        {
            '李秀英': 2,
            '张彬': 2,
            '盛先明': 2,
            '黄昌胜': 2,
            '刘怀敏': 2,
            'device_key': '84E0F42133D507B2'
        },
        {
            '李秀英': 2,
            '张彬': 2,
            '盛先明': 2,
            '黄昌胜': 2,
            '刘怀敏': 2,
            'device_key': '84E0F421480507B2'
        },
        {
            '李秀英': 2,
            '张彬': 2,
            '盛先明': 2,
            '黄昌胜': 2,
            '刘怀敏': 2,
            'device_key': '84E0F42147D007B2'
        },
        {
            '李斌': 2,
            'device_key': '84E0F422BC4C07B2'
        },
        {
            '李斌': 2,
            'device_key': '84E0F422B9DA07B2'
        },
        {
            '李斌': 2,
            'device_key': '84E0F422BC4D07B2'
        },
        {
            '吴正国': 2,
            '王龙泉': 2,
            '张义': 2,
            'device_key': '84E0F42147E907B2'
        },
        {
            '吴正国': 2,
            '王龙泉': 2,
            '张义': 2,
            'device_key': '84E0F421480107B2'
        },
        {
            '吴正国': 2,
            '王龙泉': 2,
            '张义': 2,
            'device_key': '84E0F42147C807B2'
        },
        {
            '吴正国': 2,
            '王龙泉': 2,
            '张义': 2,
            'device_key': '84E0F421336007B2'
        },
        {
            '吴正国': 2,
            '王龙泉': 2,
            '张义': 2,
            'device_key': '84E0F421336A07B2'
        },
        {
            '吴正国': 2,
            '王龙泉': 2,
            '张义': 2,
            'device_key': '84E0F421338007B2'
        },
        {
            '彭儒烽': 2,
            '彭红权': 2,
            'device_key': '84E0F4222AAD07B2'
        },
        {
            '彭儒烽': 2,
            '彭红权': 2,
            'device_key': '84E0F421AE6507B2'
        },
        {
            '郑阿旺': 2,
            'device_key': '84E0F4208F7B00B0'
        },
        {
            '郑阿旺': 2,
            'device_key': '84E0F4209C7D00B0'
        },
        {
            '郑阿旺': 2,
            'device_key': '84E0F4209FB300B0'
        },
        {
            '郑阿旺': 2,
            'device_key': '84E0F4206FAC00B0'
        },
        {
            '王芳': 2,
            '陈勇': 2,
            '杨军': 2,
            '陈鹏': 2,
            '张英': 2,
            'device_key': '84E0F42147EB07B2'
        },
        {
            '王芳': 2,
            '陈勇': 2,
            '杨军': 2,
            '陈鹏': 2,
            '张英': 2,
            'device_key': '84E0F42147F707B2'
        },
        {
            '张远庆': 2,
            'device_key': '84E0F421D9A607B2'
        },
        {
            '张远庆': 2,
            'device_key': '84E0F421D9A107B2'
        },
        {
            '刘晓平': 2,
            'device_key': '84E0F421D7E307B2'
        },
        {
            '刘晓平': 2,
            'device_key': '84E0F421D7E607B2'
        },
        {
            '刘晓平': 2,
            'device_key': '84E0F421D7DC07B2'
        },
        {
            '刘晓平': 2,
            'device_key': '84E0F421D8B807B2'
        },
        {
            '陈维现': 2,
            '李永华': 2,
            'device_key': '84E0F422731B07B2'
        },
        {
            '陈维现': 2,
            '李永华': 2,
            'device_key': '84E0F422731807B2'
        },
        {
            '陈维现': 2,
            '李永华': 2,
            'device_key': '84E0F422731907B2'
        },
        {
            '陈维现': 2,
            '李永华': 2,
            'device_key': '84E0F422673907B2'
        },
        {
            '李斌': 2,
            'device_key': '84E0F422B95707B2'
        },
        {
            '陈长龙': 2,
            'device_key': '84E0F421656107B2'
        },
        {
            '陈长龙': 2,
            'device_key': '84E0F42164A307B2'
        },
        {
            '何向前': 2,
            'device_key': '84E0F4221B9506B2'
        },
        {
            '张建林': 2,
            'device_key': '84E0F421AC3607B2'
        },
        {
            '张建林': 2,
            'device_key': '84E0F421AC2507B2'
        }
    ]
    print(len(list))


if __name__ == '__main__':
    test()
